mentatpsi/Microchip/USB/Device - Bootloaders/HID/Firmware - PIC18F87J50 Family/Boot87J50Family.c
/*********************************************************************
 *
 *   HID Device Bootloader Firmware for PIC18F87J50 Family Devices
 *
 *********************************************************************
 * FileName:        Boot87J50Family.c
 * Dependencies:    See INCLUDES section below
 * Processor:       PIC18
 * Compiler:        C18 3.45+
 * Company:         Microchip Technology, Inc.
 *
 * Software License Agreement
 *
 * The software supplied herewith by Microchip Technology Incorporated
 * (the "Company") for its PIC(R) Microcontroller is intended and
 * supplied to you, the Company's customer, for use solely and
 * exclusively on Microchip PICmicro Microcontroller products. The
 * software is owned by the Company and/or its supplier, and is
 * protected under applicable copyright laws. All rights are reserved.
 * Any use in violation of the foregoing restrictions may subject the
 * user to criminal sanctions under applicable laws, as well as to
 * civil liability for the breach of the terms and conditions of this
 * license.
 *
 * THIS SOFTWARE IS PROVIDED IN AN "AS IS" CONDITION. NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED
 * TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. THE COMPANY SHALL NOT,
 * IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * Rev   Description
 * ----  ------------------------------------
 * 2.6A  Initial Release
 * 2.9j  Added sign flash command for ruggedized
 *       software entry method recovery in event of
 *       interruption during erase/program/verify operation.
 *       Implemented extended query command and bootloader
 *       versioning system.  This release is version "1.01".
 ********************************************************************/

/** I N C L U D E S **********************************************************/
#include <p18cxxx.h>
#include "typedefs.h"
#include "string.h"
#include "usb.h"
#include "Boot87J50Family.h"


/** C O N S T A N T S **********************************************************/
//The bootloader version, which the bootloader PC application can do extended query to get.
//Value provided is expected to be in the format of BOOTLOADER_VERSION_MAJOR.BOOTLOADER_VERSION_MINOR
//Ex: 1.01 would be BOOTLOADER_VERSION_MAJOR == 1, and BOOTLOADER_VERSION_MINOR == 1
#define BOOTLOADER_VERSION_MAJOR         1 //Legal value 0-255
#define BOOTLOADER_VERSION_MINOR         1 //Legal value 0-99.  (1 = X.01)

//Section defining the address range to erase for the erase device command, along with the valid programming range to be reported by the QUERY_DEVICE command.
#define StartPageToErase				4		 //The 1024 byte page starting at address 0x1000 will be erased.
#define PROGRAM_MEM_START_ADDRESS		0x1000  //Beginning of application program memory (not occupied by bootloader).  **THIS VALUE MUST BE ALIGNED WITH 64 BYTE BLOCK BOUNDRY** Also, in order to work correctly, make sure the StartPageToErase is set to erase this section.
#define CONFIG_WORDS_SECTION_LENGTH		8   	//8 bytes worth of Configuration words on the PIC18F87J50 Family devices
#define WRITE_BLOCK_SIZE                64
#define ERASE_PAGE_SIZE                 1024
#define ERASE_PAGE_ADDRESS_MASK         0xFFFC00

#if defined(__18F87J50)||defined(__18F67J50)
	#define MaxPageToEraseNoConfigs		126		 //Last page of flash on the PIC18F87J50, which does not contain the flash configuration words.
	#define MaxPageToEraseWithConfigs	127		 //Page 127 contains the flash configurations words on the PIC18F87J50.
	#define ProgramMemStopNoConfigs		0x01FC00 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If AddressToStopPopulating = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**	
	#define ProgramMemStopWithConfigs	0x01FFF8 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If AddressToStopPopulating = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**	
	#define CONFIG_WORDS_START_ADDRESS	0x01FFF8 //0xXXXF8 is CONFIG1L on PIC18F87J50 family devices
#elif defined(__18F86J55)||defined(__18F66J55)
	#define MaxPageToEraseNoConfigs		94		 //Last page of flash on the PIC18F87J50, which does not contain the flash configuration words.
	#define MaxPageToEraseWithConfigs	95		 //Page 127 contains the flash configurations words on the PIC18F87J50.
	#define ProgramMemStopNoConfigs		0x017C00 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If AddressToStopPopulating = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**	
	#define ProgramMemStopWithConfigs	0x017FF8 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If AddressToStopPopulating = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**	
	#define CONFIG_WORDS_START_ADDRESS	0x017FF8 //0xXXXF8 is CONFIG1L on PIC18F87J50 family devices
#elif defined(__18F86J50)||defined(__18F66J50)
	#define MaxPageToEraseNoConfigs		62		 //Last page of flash on the PIC18F87J50, which does not contain the flash configuration words.
	#define MaxPageToEraseWithConfigs	63		 //Page 127 contains the flash configurations words on the PIC18F87J50.
	#define ProgramMemStopNoConfigs		0x00FC00 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If AddressToStopPopulating = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**	
	#define ProgramMemStopWithConfigs	0x00FFF8 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If AddressToStopPopulating = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**	
	#define CONFIG_WORDS_START_ADDRESS	0x00FFF8 //0xXXXF8 is CONFIG1L on PIC18F87J50 family devices
#elif defined(__18F85J50)||defined(__18F65J50)
	#define MaxPageToEraseNoConfigs		30		 //Last page of flash on the PIC18F87J50, which does not contain the flash configuration words.
	#define MaxPageToEraseWithConfigs	31		 //Page 127 contains the flash configurations words on the PIC18F87J50.
	#define ProgramMemStopNoConfigs		0x007C00 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If AddressToStopPopulating = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**	
	#define ProgramMemStopWithConfigs	0x007FF8 //**MUST BE WORD ALIGNED (EVEN) ADDRESS.  This address does not get updated, but the one just below it does: IE: If AddressToStopPopulating = 0x200, 0x1FF is the last programmed address (0x200 not programmed)**	
	#define CONFIG_WORDS_START_ADDRESS	0x007FF8 //0xXXXF8 is CONFIG1L on PIC18F87J50 family devices
#endif

