mentatpsi/Microchip/USB/Device - Bootloaders/HID/Firmware - PIC18F87J50 Family/Boot87J50Family.c
    //First read in the erase page contents of the page with the signature WORD
    //in it, and temporarily store it in a RAM buffer.
    TBLPTR = (APP_SIGNATURE_ADDRESS & ERASE_PAGE_ADDRESS_MASK);
    for(i = 0; i < ERASE_PAGE_SIZE; i++)
    {
        _asm tblrdpostinc _endasm  
        ProgrammingBuffer[i] = TABLAT;        
    }    
    
    //Now change the signature WORD value at the correct address in the RAM buffer
    ProgrammingBuffer[(APP_SIGNATURE_ADDRESS & ~ERASE_PAGE_ADDRESS_MASK)] = (unsigned char)APP_SIGNATURE_VALUE;
    ProgrammingBuffer[(APP_SIGNATURE_ADDRESS & ~ERASE_PAGE_ADDRESS_MASK) + 1] = (unsigned char)(APP_SIGNATURE_VALUE >> 8);
    
    //Now erase the flash memory block with the signature WORD in it
    EraseFlashPage(APP_SIGNATURE_ADDRESS >> 10);
    
    //Now re-program the values from the RAM buffer into the flash memory.  Use
    //reverse order, so we program the larger addresses first.  This way, the 
    //write page with the flash signature word is the last page that gets 
    //programmed (assuming the flash signature resides on the lowest address
    //write page, which is recommended, so that it becomes the first page
    //erased, and the last page programmed).
    TBLPTR = (APP_SIGNATURE_ADDRESS & ERASE_PAGE_ADDRESS_MASK) + ERASE_PAGE_SIZE - 1;   //Point to last byte on the erase page
    i = ERASE_PAGE_SIZE - 1;
    while(1)
    {
        TABLAT = ProgrammingBuffer[i];
        _asm tblwt _endasm

        //Check if we are at a program write block size boundary
        if((i % WRITE_BLOCK_SIZE) == 0)
        {
            //The write latches are full, time to program the block.
            ClearWatchdog();
            EECON1 = 0x04;  //Write to flash (block write) on next WR = 1 operation
            UnlockAndActivate(CORRECT_UNLOCK_KEY);
        }    
        _asm tblrdpostdec _endasm   //Move TBLPTR back to next location
        
        //Check if we are done writing all blocks
        if(i == 0)
        {
            break;  //Exit while loop
        }    
        i--;
    }    
}    


//Before resetting the microcontroller, we should shut down the USB module 
//gracefully, to make sure the host correctly recognizes that we detached
//from the bus.  Some USB hosts malfunction/fail to re-enumerate the device
//correctly if the USB device does not stay detached for a minimum amount of
//time before re-attaching to the USB bus.  For reliable operation, the USB
//device should stay detached for as long as a human would require to unplug and
//reattach a USB device (ex: 100ms+), to ensure the USB host software has a 
//chance to process the detach event and configure itself for a state ready for 
//a new attachment event.
void ResetDeviceCleanly(void)
{
    DisableUSBandExecuteLongDelay();
	Reset();    
	Nop();
	Nop();
}    


//Disable the USB module and then wait a long time (long enough for the host
//to correctly detect the USB detach event, process the plug and play event,
//and get itself back into a state ready for a new USB attach event.
void DisableUSBandExecuteLongDelay(void)
{
    uint_delay_counter = 65535;
    while(uint_delay_counter--)
    {
        //Disable USB module (this doens't need to be done in the loop, but we 
        //add it to the loop to deliberately make the loop execute slower)
        UCONbits.SUSPND = 0;    //Make sure not in suspend mode
        UCON = 0x00;            
        ClearWatchdog();
    }   
}    


//Routine used to write data to the flash memory from the ProgrammingBuffer[].
//Note: Function uses WORD writes.  Always make sure the quantity of data in the
//buffer is an exact multiple of the program write word size (2 bytes).
void WriteFlashSubBlock(void)		//Use word writes to write code chunks less than a full 64 byte block size.
{
	static unsigned char i;
	
	i = 0;
	while(BufferedDataIndex > 0)		//While data is still in the buffer.
	{
		TBLPTR = (ProgrammedPointer - BufferedDataIndex);
		//Below section will need to be modified if the WORDSIZE of your processor is not 2 bytes.
		TABLAT = ProgrammingBuffer[i];
		_asm
		tblwtpostinc
		_endasm
		i++;		
		TABLAT = ProgrammingBuffer[i];
		_asm
		tblwt					//Do not increment TBLPTR on the second write.  See datasheet.
		_endasm
		i++;
		
		EECON1 = 0b00100100;	                //Word programming mode
		UnlockAndActivate(CORRECT_UNLOCK_KEY);  //Now make the operation take place
	
		BufferedDataIndex = BufferedDataIndex - WORDSIZE;	//Used up one word from the buffer.
	}
}






//It is preferrable to only place this sequence in only one place in the flash memory.
//This reduces the probabilty of the code getting executed inadvertently by
//errant code.  It is also recommended to enable BOR (in hardware) and/or add
//software checks to avoid microcontroller "overclocking".  Always make sure
//to obey the voltage versus frequency graph in the datasheet, even during
//momentary events (such as the power up and power down ramp of the microcontroller).
void UnlockAndActivate(unsigned char UnlockKey)
{
	INTCONbits.GIE = 0;		//Make certain interrupts disabled for unlock process.

    //Make sure voltage is sufficient for safe self erase/write operations
    LowVoltageCheck();

    //Check to make sure the caller really was trying to call this function.
    //If they were, they should always pass us the CORRECT_UNLOCK_KEY.
    if(UnlockKey != CORRECT_UNLOCK_KEY)
    {
        //Warning!  Errant code execution detected.  Somehow this 
        //UnlockAndActivate() function got called by someone that wasn't trying
        //to actually perform an NVM erase or write.  This could happen due to
        //microcontroller overclocking (or undervolting for an otherwise allowed
        //CPU frequency), or due to buggy code (ex: incorrect use of function 
        //pointers, etc.).  In either case, we should execute some fail safe 
        //code here to prevent corruption of the NVM contents.
        OSCCON = 0x03;  //Switch to INTOSC at low frequency
        while(1)
        {
            Sleep();
        }    
        Reset();
    }    
    
	_asm
	//Now unlock sequence to set WR (make sure interrupts are disabled before executing this)
	MOVLW 0x55
	MOVWF EECON2, 0
	MOVLW 0xAA
	MOVWF EECON2, 0
	BSF EECON1, 1, 0		//Performs write
	_endasm	
	while(EECON1bits.WR);	//Wait until complete (relevant when programming EEPROM, not important when programming flash since processor stalls during flash program)	
	EECON1bits.WREN = 0;  	//Good practice now to clear the WREN bit, as further protection against any accidental activation of self write/erase operations.
}	


void EraseFlashPage(unsigned char PageNumToErase)
{
    //Error check to make sure we aren't erasing part of the bootloader itself
    if(PageNumToErase < StartPageToErase)
        PageNumToErase = StartPageToErase; 
    
	//Really want this: TBLPTR = ((unsigned short long)PageNumToErase << 10); 
	//but the compiler is not very efficient at this, so instead do this:
	TBLPTRL = 0x00;
	TBLPTRH = PageNumToErase;
	TBLPTRU = 0x00;
	_asm
	bcf		STATUS, 0, 0
	rlcf	TBLPTRH, 1, 0
	rlcf	TBLPTRU, 1, 0
	rlcf	TBLPTRH, 1, 0
	rlcf	TBLPTRU, 1, 0
	_endasm 

	EECON1 = 0b00010100;
    UnlockAndActivate(CORRECT_UNLOCK_KEY);
}


//Note: The ClrWdt() and "_asm tblrdpostinc _endasm" are inline assembly language
//instructions.  The ClearWatchdog() and  TableReadPostIncrement() functions are 
//theoretically extraneous, since the operations being accomplished could be
//done without calling them as separate functions.  However, when using inline
//assembly language, the C compiler normally doesn't know what the code will
//actually do (ex: will it modify STATUS reg, WREG, BSR contents??).  As a 
//result, it is potentially dangerous for the C compiler to make assumptions,
//that might turn out not to be correct.  Therefore, the C18 compiler disables
//the compiler optimizations for a function, when one or more inline asm 
//instructions are located within the C function.  Therefore, to promote best
//code size optimizations from the C compiler, it is best to locate inline
//assembly sequences in their own separate C functions, that do not contain much
//other code (which could otherwise be optimized by the C compiler).  This often
//results in the smallest code size, and is the reason it is being done here.
void ClearWatchdog(void)
{
    ClrWdt();
}    
void TableReadPostIncrement(void)
{
	_asm tblrdpostinc _endasm    
}    


/** EOF Boot87J50Family.c *********************************************************/
